# Airbnb Database Load into PostgreSQL

## Project III 

    Katy Fuentes, Nicole Pipkins, Radhika Balasubramaniam, Reza Abasaltian
    December 5, 2020

### Reference the following JSON files to tables data load
        
        city_nbh --> top_nbh_id-120420j
        
        listings_info --> airbnb-listings-120920j
        
        neighborhood_insights --> top_nbh_overview-120320j

        neighborhood_overview --> top_nbh_overviewSPF-120320j
        
        rental_rates --> airbnb-nbh-rates-120420j
        
        rental_rates_info --> airbnb-nbh-rates-120420j
        
        top_airbnb_cities --> topAirbnbCities-120420j
        
        top_neighborhood_overview --> top_nbh_overviewSPF-120320j

In [1]:
# Import dependencies
import requests
import random
import sqlalchemy
import warnings
import pandas as pd
import json
import ast
import os

from pprint import pprint
from datetime import datetime, timedelta
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, inspect
from pandas.core.common import SettingWithCopyWarning

# Postgres database user and password import
# from config import password
from db_key import user, password

warnings.simplefilter(action="ignore", category=SettingWithCopyWarning)

# Set today as current date and time
t = datetime.now()

# Print todays date formatted as mm/dd/yy
date = t.strftime('%m/%d/%y')
datef = t.strftime('%m%d%y')

# format time to round to the nearest hour in hundreds
time = (t.replace(second=0, microsecond=0, minute=0, hour=t.hour)
                        + timedelta(hours=t.minute//30))
hour = time.strftime('%H'+'00')

print(f'Today is {date} @ {hour} hour.')

Today is 12/09/20 @ 1100 hour.

In [2]:
datef = "120320"
f = open(f'../data/mash-api/{datef}/top_nbh_overviewSPF-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
nbhstr = json.dumps(s)
nbhjson = json.loads(nbhstr)
nbhbnb = ast.literal_eval(nbhjson)
df_nbh = pd.DataFrame(nbhbnb)
df_nbh = df_nbh.T
df_nbh['nbh_id'] = df_nbh.index
df_nbh.head()

,name,city,county,state,lat,lon,walkscore,airbnb_count,other_count,avg_occupancy,median_price,sqft_price,nbh_id
273471,Dignowity Hill-St. Paul Square,San Antonio,Bexar,TX,29.4222,-98.4792,57,229,25,51.6376,262500,246.25,273471
271352,Downtown,San Antonio,Bexar,TX,29.4241,-98.4872,74,225,6,52.68,605000,369.23,271352
275804,United Homeowners,San Antonio,Bexar,TX,29.4401,-98.4273,14,210,0,56.5571,131000,113.72,275804
271349,Dignowity Hill,San Antonio,Bexar,TX,29.4274,-98.4723,51,208,3,53.5433,253750,211.3,271349
274033,Historic Gardens,San Antonio,Bexar,TX,29.4159,-98.4747,45,199,8,51.794,269950,165.95,274033

In [3]:
#specific columns from df - database load
nbh_columns = ["nbh_id","name", "county", "state"]
nbh_tran = df_nbh[nbh_columns].copy()
nbh_tran.head()

        nbh_id                            name county state
273471  273471  Dignowity Hill-St. Paul Square  Bexar    TX
271352  271352                        Downtown  Bexar    TX
275804  275804               United Homeowners  Bexar    TX
271349  271349                  Dignowity Hill  Bexar    TX
274033  274033                Historic Gardens  Bexar    TX

In [6]:
#database connection
engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/airbnb_db')
engine.table_names()

['listings_info',
 'top_neighborhood_overview',
 'rental_rates_info',
 'neighborhood_overview',
 'rental_rates',
 'city_nbh',
 'top_airbnb_cities',
 'merged_census_crime',
 'neighborhood_insights']

In [5]:
#already data loaded, dont run again
nbh_tran.to_sql(name='top_neighborhood_overview', con=engine, if_exists='append', index=False)

In [6]:
#confirm data has been loaded to sql table
nbh_ovw = pd.read_sql_query('select * from top_neighborhood_overview', con=engine)
nbh_ovw.head()

   nbh_id                            name county state
0  273471  Dignowity Hill-St. Paul Square  Bexar    TX
1  271352                        Downtown  Bexar    TX
2  275804               United Homeowners  Bexar    TX
3  271349                  Dignowity Hill  Bexar    TX
4  274033                Historic Gardens  Bexar    TX

In [10]:
#specific columns from df - database load
nbh_columns = ["nbh_id","lat", "lon", "walkscore", "airbnb_count", "other_count", "avg_occupancy", "median_price", "sqft_price"]
nbh_tran_ovw = df_nbh[nbh_columns].copy()
nbh_tran_ovw = nbh_tran_ovw.rename(columns={"lat": "latitude", "lon":"longitude"})
nbh_tran_ovw.head()

,nbh_id,latitude,longitude,walkscore,airbnb_count,other_count,avg_occupancy,median_price,sqft_price
273471,273471,29.4222,-98.4792,57,229,25,51.6376,262500,246.25
271352,271352,29.4241,-98.4872,74,225,6,52.68,605000,369.23
275804,275804,29.4401,-98.4273,14,210,0,56.5571,131000,113.72
271349,271349,29.4274,-98.4723,51,208,3,53.5433,253750,211.3
274033,274033,29.4159,-98.4747,45,199,8,51.794,269950,165.95

In [62]:
# Check for data integrity
for i in range(len(nbh_tran_ovw)):
    if (nbh_tran_ovw.iloc[i]['sqft_price'] == ""):
        nbh_tran_ovw['sqft_price'][i] = 0.0
nbh_tran_ovw.head()

,nbh_id,latitude,longitude,walkscore,airbnb_count,other_count,avg_occupancy,median_price,sqft_price
273471,273471,29.4222,-98.4792,57,229,25,51.6376,262500,246.25
271352,271352,29.4241,-98.4872,74,225,6,52.68,605000,369.23
275804,275804,29.4401,-98.4273,14,210,0,56.5571,131000,113.72
271349,271349,29.4274,-98.4723,51,208,3,53.5433,253750,211.3
274033,274033,29.4159,-98.4747,45,199,8,51.794,269950,165.95

In [28]:
#already data loaded, dont run again
nbh_tran_ovw.to_sql(name='neighborhood_overview', con=engine, if_exists='append', index=False)

In [30]:
#confirm data has been loaded to sql table
nbh_ovw_sql = pd.read_sql_query('select * from neighborhood_overview', con=engine)
nbh_ovw_sql.head()

,nbh_id,latitude,longitude,walkscore,airbnb_count,other_count,avg_occupancy,median_price,sqft_price
0,273471,29.422160,-98.479162,57,229,25,51.6376,262500.0,246.25
1,271352,29.424127,-98.487186,74,225,6,52.6800,605000.0,369.23
2,275804,29.440150,-98.427296,14,210,0,56.5571,131000.0,113.72
3,271349,29.427419,-98.472334,51,208,3,53.5433,253750.0,211.30
4,274033,29.415926,-98.474659,45,199,8,51.7940,269950.0,165.95

In [56]:
datef = "120320"
f = open(f'../data/mash-api/{datef}/top_nbh_overview-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
nbhstr = json.dumps(s)
nbhjson = json.loads(nbhstr)
nbhbnb = ast.literal_eval(nbhjson)
df_nbh_insight = pd.DataFrame(nbhbnb)
insight = df_nbh_insight['content']
print(insight[0])

{'id': '273471', 'name': 'Dignowity Hill-St. Paul Square', 'city': 'San Antonio', 'county': 'Bexar', 'state': 'TX', 'is_village': 0, 'description': '', 'image': 'https://9ac82074a42d61a93c2a-4910baab8d3df1a59178432e0b86512c.ssl.cf5.rackcdn.com', 'latitude': 29.42216, 'longitude': -98.479162, 'walkscore': 57, 'num_of_properties': 1, 'num_of_airbnb_properties': 229, 'num_of_traditional_properties': 25, 'median_price': 262500, 'price_per_sqft': 246.25, 'mashMeter': 65.89, 'mashMeterStars': 3, 'avg_occupancy': 51.6376, 'strategy': 'airbnb', 'airbnb_rental': {'roi': -1.6581143141, 'cap_rate': 8.3748382813, 'rental_income': 1831.9958740234, 'rental_income_change': 'up', 'rental_income_change_percentage': 22.9219659409, 'night_price': 61.0665291341, 'occupancy': 51.6376, 'occupancy_change': 'up', 'occupancy_change_percentage': 16.7060212515, 'insights': {'bedrooms': {'slope': -0.0294775229, 'RSquare': 0.0277814662}, 'price': {'slope': -0.0004830487, 'RSquare': 0.0757655382}, 'stars_rate': {'slope': -1, 'RSquare': -1}, 'bathrooms': {'slope': -0.0510313466, 'RSquare': 0.0383196528}, 'beds': {'slope': -1, 'RSquare': -1}, 'reviews_count': {'slope': 0.0006054417, 'RSquare': 0.0517582554}}}, 'traditional_rental': {'roi': -1.704480052, 'cap_rate': 5.2658102857, 'rental_income': 1151.896, 'rental_income_change': 'up', 'rental_income_change_percentage': 0, 'night_price': 38.3965333333, 'occupancy': 94.5, 'occupancy_change': ''}}

In [61]:
rental_insights = []
for i in range(len(insight)):
    rental_insight = {
        "nbh_id": insight[i]['id'],
        "rental_income": insight[i]['airbnb_rental']['rental_income'],
        "rental_income_change": insight[i]['airbnb_rental']['rental_income_change'],
        "rental_income_change_pct": insight[i]['airbnb_rental']['rental_income_change_percentage'],
        "occupancy": insight[i]['airbnb_rental']['occupancy'],
        "occupancy_change": insight[i]['airbnb_rental']['occupancy_change'],
        "occupancy_change_pct": insight[i]['airbnb_rental']['occupancy_change_percentage'],
        "bedrm_slope": insight[i]['airbnb_rental']['insights']['bedrooms']['slope'],
        "bedrm_rsquare": insight[i]['airbnb_rental']['insights']['bedrooms']['RSquare'],
        "price_slope": insight[i]['airbnb_rental']['insights']['price']['slope'],
        "price_rsquare": insight[i]['airbnb_rental']['insights']['price']['RSquare'],
        "stars_rate_slope": insight[i]['airbnb_rental']['insights']['stars_rate']['slope'],
        "stars_rate_rsquare": insight[i]['airbnb_rental']['insights']['stars_rate']['RSquare'],
        "bathrms_slope": insight[i]['airbnb_rental']['insights']['bathrooms']['slope'],
        "bathrms_rsquare": insight[i]['airbnb_rental']['insights']['bathrooms']['RSquare'],
        "beds_slope": insight[i]['airbnb_rental']['insights']['beds']['slope'],
        "beds_rsquare": insight[i]['airbnb_rental']['insights']['beds']['RSquare'],
        "reviews_count_slope": insight[i]['airbnb_rental']['insights']['reviews_count']['slope'],
        "reviews_count_rsquare": insight[i]['airbnb_rental']['insights']['reviews_count']['RSquare']
    }
    rental_insights.append(rental_insight)

df_nbh_insights = pd.DataFrame(rental_insights)
df_nbh_insights.head()

,nbh_id,rental_income,rental_income_change,rental_income_change_pct,occupancy,occupancy_change,occupancy_change_pct,bedrm_slope,bedrm_rsquare,price_slope,price_rsquare,stars_rate_slope,stars_rate_rsquare,bathrms_slope,bathrms_rsquare,beds_slope,beds_rsquare,reviews_count_slope,reviews_count_rsquare
0,273471,1832,up,22.921966,51.6376,up,16.706021,-0.029478,0.027781,-0.000483,0.075766,-1.0,-1.0,-0.051031,0.038320,-1.000000,-1.000000,0.000605,0.051758
1,271352,1765.28,up,14.879294,52.6800,up,5.800958,-0.036612,0.044118,-0.000468,0.077935,-1.0,-1.0,-0.056392,0.048490,-0.024373,0.041828,0.000613,0.056126
2,275804,1864.16,up,24.932323,56.5571,up,19.615315,-0.036604,0.029508,-0.001525,0.118091,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000
3,271349,1773.03,up,31.809016,53.5433,up,14.483475,-0.030055,0.022153,-0.000676,0.053700,-1.0,-1.0,-0.056734,0.023454,-1.000000,-1.000000,0.000569,0.040497
4,274033,1649.5,up,44.721200,51.7940,up,37.780127,-1.000000,-1.000000,-0.000786,0.085315,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,0.000389,0.020878

In [67]:
# Check for data integrity
for i in range(len(df_nbh_insights)):
    if (df_nbh_insights.iloc[i]['rental_income'] == ""):
        df_nbh_insights['rental_income'][i] = 0.0
df_nbh_insights.head()

,nbh_id,rental_income,rental_income_change,rental_income_change_pct,occupancy,occupancy_change,occupancy_change_pct,bedrm_slope,bedrm_rsquare,price_slope,price_rsquare,stars_rate_slope,stars_rate_rsquare,bathrms_slope,bathrms_rsquare,beds_slope,beds_rsquare,reviews_count_slope,reviews_count_rsquare
0,273471,1832,up,22.921966,51.6376,up,16.706021,-0.029478,0.027781,-0.000483,0.075766,-1.0,-1.0,-0.051031,0.038320,-1.000000,-1.000000,0.000605,0.051758
1,271352,1765.28,up,14.879294,52.6800,up,5.800958,-0.036612,0.044118,-0.000468,0.077935,-1.0,-1.0,-0.056392,0.048490,-0.024373,0.041828,0.000613,0.056126
2,275804,1864.16,up,24.932323,56.5571,up,19.615315,-0.036604,0.029508,-0.001525,0.118091,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000
3,271349,1773.03,up,31.809016,53.5433,up,14.483475,-0.030055,0.022153,-0.000676,0.053700,-1.0,-1.0,-0.056734,0.023454,-1.000000,-1.000000,0.000569,0.040497
4,274033,1649.5,up,44.721200,51.7940,up,37.780127,-1.000000,-1.000000,-0.000786,0.085315,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,0.000389,0.020878

In [68]:
#already data loaded, dont run again
df_nbh_insights.to_sql(name='neighborhood_insights', con=engine, if_exists='append', index=False)

In [69]:
#confirm data has been loaded to sql table
rentals = pd.read_sql_query('select * from neighborhood_insights', con=engine)
rentals.head()

,nbh_id,rental_income,rental_income_change,rental_income_change_pct,occupancy,occupancy_change,occupancy_change_pct,bedrm_slope,bedrm_rsquare,price_slope,price_rsquare,stars_rate_slope,stars_rate_rsquare,bathrms_slope,bathrms_rsquare,beds_slope,beds_rsquare,reviews_count_slope,reviews_count_rsquare
0,273471,1831.995874,up,22.921966,51.6376,up,16.706021,-0.029478,0.027781,-0.000483,0.075766,-1.0,-1.0,-0.051031,0.038320,-1.000000,-1.000000,0.000605,0.051758
1,271352,1765.276880,up,14.879294,52.6800,up,5.800958,-0.036612,0.044118,-0.000468,0.077935,-1.0,-1.0,-0.056392,0.048490,-0.024373,0.041828,0.000613,0.056126
2,275804,1864.161475,up,24.932323,56.5571,up,19.615315,-0.036604,0.029508,-0.001525,0.118091,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000
3,271349,1773.033105,up,31.809016,53.5433,up,14.483475,-0.030055,0.022153,-0.000676,0.053700,-1.0,-1.0,-0.056734,0.023454,-1.000000,-1.000000,0.000569,0.040497
4,274033,1649.495825,up,44.721200,51.7940,up,37.780127,-1.000000,-1.000000,-0.000786,0.085315,-1.0,-1.0,-1.000000,-1.000000,-1.000000,-1.000000,0.000389,0.020878

In [100]:
datef = "120420"
f = open(f'../data/mash-api/{datef}/topAirbnbCities-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
citystr = json.dumps(s)
cityjson = json.loads(citystr)
citybnb = ast.literal_eval(cityjson)
df_city = pd.DataFrame(citybnb)
df_city = df_city.T
df_city.head()

            state occupancy total_listing
San Antonio    TX    56.797          8140
Austin         TX   52.7838          4919
Fort Worth     TX   55.8932          3326
Dallas         TX    55.943          2748
Houston        TX   52.8638          2638

In [105]:
# assign a custom city id
df_city['city_id'] = ""
alph = 'abcdefghijklmnopqrstuvwxyz'
for i in range(len(df_city)):
    cid = 0
    for j in range(len(df_city.index[i])):
        cid = cid + alph.find(df_city.index[i][j].lower())**3
    df_city['city_id'][i] = cid
df_city['city'] = df_city.index
df_city.head()

            state occupancy total_listing city_id         city
San Antonio    TX    56.797          8140   25281  San Antonio
Austin         TX   52.7838          4919   23400       Austin
Fort Worth     TX   55.8932          3326   40147   Fort Worth
Dallas         TX    55.943          2748    8521       Dallas
Houston        TX   52.8638          2638   28719      Houston

In [106]:
#already data loaded, dont run again
df_city.to_sql(name='top_airbnb_cities', con=engine, if_exists='append', index=False)

In [107]:
#confirm data has been loaded to sql table
cities_sql = pd.read_sql_query('select * from top_airbnb_cities', con=engine)
cities_sql.head()

   city_id         city state  occupancy  total_listing
0    25281  San Antonio    TX  56.797013           8140
1    23400       Austin    TX  52.783775           4919
2    40147   Fort Worth    TX  55.893224           3326
3     8521       Dallas    TX  55.943032           2748
4    28719      Houston    TX  52.863818           2638

In [136]:
datef = "120420"
f = open(f'../data/mash-api/{datef}/top_nbh_id-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
nbh_citystr = json.dumps(s)
nbh_cityjson = json.loads(nbh_citystr)
nbh_citybnb = ast.literal_eval(nbh_cityjson)
df_nbhcity = pd.DataFrame(nbh_citybnb)
df_nbhcity = df_nbhcity.T
df_nbhcity['nbh_id'] = df_nbhcity.index
df_merge = pd.merge(df_nbhcity, df_city)
merge_columns = ["nbh_id", "city_id"]
df_city_nbh = df_merge[merge_columns].copy()
df_city_nbh.head()

   nbh_id city_id
0  273471   25281
1  271352   25281
2  275804   25281
3  271349   25281
4  274033   25281

In [137]:
#already data loaded, dont run again
df_city_nbh.to_sql(name='city_nbh', con=engine, if_exists='append', index=False)

In [138]:
#confirm data has been loaded to sql table
cities_nbh_sql = pd.read_sql_query('select * from city_nbh', con=engine)
cities_nbh_sql.head()

   nbh_id  city_id
0  273471    25281
1  271352    25281
2  275804    25281
3  271349    25281
4  274033    25281

In [3]:
datef = "120920"
f = open(f'../data/mash-api/{datef}/airbnb-listings-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
listingsstr = json.dumps(s)
listingsjson = json.loads(listingsstr)
listingsbnb = ast.literal_eval(listingsjson)
df_listings = pd.DataFrame(listingsbnb)
df_listings = df_listings.T
df_listings['airbnb_id'] = df_listings.index
df_listings

,host_id,nbh_id,lat,lon,city,state,night_price,cleaning_fee,nights_booked,rental_income,property_type,room_count,bed_count,max_capacity,star_rating,total_reviews,date_created,date_updated,airbnb_id
27874948,11555442,273471,29.4175,-98.496,San Antonio,TX,305,175,59,1800,House,5,3,8,5,8,2020-10-30T17:58:18.000Z,2020-10-30T17:58:18.000Z,27874948
27874733,11654041,273471,29.4165,-98.4858,San Antonio,TX,159,70,107,1547,Guesthouse,1,1,3,5,55,2020-10-30T17:57:51.000Z,2020-10-30T17:57:51.000Z,27874733
27874722,13361985,273471,29.4273,-98.4893,San Antonio,TX,119,25,93,922,Apartment,1,1,2,5,103,2020-10-30T17:57:50.000Z,2020-10-30T17:57:50.000Z,27874722
27874807,13882643,273471,29.4107,-98.4776,San Antonio,TX,54,75,201,905,Guesthouse,1,2,4,5,28,2020-10-30T17:58:02.000Z,2020-10-30T17:58:02.000Z,27874807
27874771,13996317,273471,29.4133,-98.4953,San Antonio,TX,104,50,243,2106,Apartment,1,1,2,5,190,2020-10-30T17:57:57.000Z,2020-10-30T17:57:57.000Z,27874771
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23700606,1667080,403492,38.9043,-77.0002,Washington,DC,99,50,329,2714,Guest suite,0,1,2,5,213,2020-10-31T02:30:20.000Z,2020-10-31T02:30:20.000Z,23700606
23700478,16882568,403492,38.8847,-77.0035,Washington,DC,112,40,313,2921,Apartment,1,2,5,5,284,2020-10-31T02:29:44.000Z,2020-10-31T02:29:44.000Z,23700478
23699872,17156975,403492,38.8965,-76.9991,Washington,DC,152,135,265,3357,Apartment,2,2,6,5,216,2020-10-31T02:27:03.000Z,2020-10-31T02:27:03.000Z,23699872
23699546,17231793,403492,38.8986,-76.9947,Washington,DC,73,50,246,1497,Guest suite,1,1,2,5,310,2020-10-31T02:25:36.000Z,2020-10-31T02:25:36.000Z,23699546
23698984,17404680,403492,38.9012,-76.9952,Washington,DC,127,90,189,2000,House,2,3,4,5,90,2020-10-31T02:23:02.000Z,2020-10-31T02:23:02.000Z,23698984

In [4]:
#df_listingsM = pd.concat([df_listings, df_city_nbh['nbh_id']])
#df_listingsR = df_listingsM.reset_index()
#del df_listingsR[0]
#del df_listingsR['index']
#rownum = []
#for i in range(len(df_listingsR)):
#    if (str(df_listingsR.iloc[i]['nbh_id']) == 'nan'):
#        rownum.append(i)
#        
#df_listingsRD = df_listingsR.drop(rownum[0:(len(rownum))])
#df_listingsRD

In [7]:
#already data loaded, dont run again
df_listings.to_sql(name='listings_info', con=engine, if_exists='append', index=False)

In [8]:
#confirm data has been loaded to sql table
cities_nbh_sql = pd.read_sql_query('select * from listings_info', con=engine)
cities_nbh_sql.head()

,airbnb_id,nbh_id,host_id,lat,lon,city,state,night_price,cleaning_fee,nights_booked,rental_income,property_type,room_count,bed_count,max_capacity,star_rating,total_reviews,date_created,date_updated
0,27874948,273471,11555442,29.4175,-98.4960,San Antonio,TX,305.0,175.0,59,1800.0,House,5,3,8,5.0,8,2020-10-30,2020-10-30
1,27874733,273471,11654041,29.4165,-98.4858,San Antonio,TX,159.0,70.0,107,1547.0,Guesthouse,1,1,3,5.0,55,2020-10-30,2020-10-30
2,27874722,273471,13361985,29.4273,-98.4893,San Antonio,TX,119.0,25.0,93,922.0,Apartment,1,1,2,5.0,103,2020-10-30,2020-10-30
3,27874807,273471,13882643,29.4107,-98.4776,San Antonio,TX,54.0,75.0,201,905.0,Guesthouse,1,2,4,5.0,28,2020-10-30,2020-10-30
4,27874771,273471,13996317,29.4133,-98.4953,San Antonio,TX,104.0,50.0,243,2106.0,Apartment,1,1,2,5.0,190,2020-10-30,2020-10-30

In [272]:
datef = "120420"
f = open(f'../data/mash-api/{datef}/airbnb-nbh-rates-{datef}j.json', 'r')
s = f.read()
s = s.replace("null", "''")
ratesstr = json.dumps(s)
ratesjson = json.loads(ratesstr)
ratesbnb = ast.literal_eval(ratesjson)
df_rates = pd.DataFrame(ratesbnb)
rates = df_rates['content']
rates

0      {'retnal_rates': {'studio_value': 1195, 'one_r...
1      {'retnal_rates': {'studio_value': 1164.5, 'one...
2      {'retnal_rates': {'studio_value': 1309, 'one_r...
3      {'retnal_rates': {'studio_value': 816, 'one_ro...
4      {'retnal_rates': {'studio_value': 939, 'one_ro...
                             ...
100    {'retnal_rates': {'studio_value': 1742.5, 'one...
101    {'retnal_rates': {'studio_value': 1944, 'one_r...
102    {'retnal_rates': {'studio_value': 1900, 'one_r...
103    {'retnal_rates': {'studio_value': 1894.5, 'one...
104    {'retnal_rates': {'studio_value': 1936, 'one_r...
Name: content, Length: 105, dtype: object

In [279]:
rr_nbhs = []
for i in range(len(rates)):
    
    if (rates[i]['retnal_rates']['four_room_value'] == ""):
        four = rates[i]['retnal_rates']['three_room_value']
    else:
        four = rates[i]['retnal_rates']['four_room_value']
    
    rr_nbh = {
        "nbh_id": rates[i]['detailed'][0]['neighborhood'],
        "studio": rates[i]['retnal_rates']['studio_value'],
        "one_room": rates[i]['retnal_rates']['one_room_value'],
        "two_room": rates[i]['retnal_rates']['two_room_value'],
        "three_room": rates[i]['retnal_rates']['three_room_value'],
        "four_room": four,
        "sample_count": rates[i]['sample_count']
    }
    rr_nbhs.append(rr_nbh)
df_rr_nbh = pd.DataFrame(rr_nbhs)
df_rr_nbh

     nbh_id  studio  one_room  two_room  three_room  four_room  sample_count
0    273471  1195.0    1321.0    1527.0      2037.0     3505.0           229
1    271352  1164.5    1347.0    1635.5      2035.5     2804.0           225
2    275804  1309.0    1131.0    1383.0      1870.0     3576.0           210
3    271349   816.0    1518.5    1457.0      2018.5     2706.0           208
4    274033   939.0    1179.0    1549.5      2034.0     2440.5           199
..      ...     ...       ...       ...         ...        ...           ...
100  403138  1742.5    2038.0    3021.0      4880.0     6620.5           459
101  403491  1944.0    2100.0    2423.0      4336.0     6933.0           300
102  121750  1900.0    2100.0    2247.0      4100.0     6571.5           266
103  403490  1894.5    2012.5    2442.0      4278.0     7768.5           258
104  403492  1936.0    2110.5    2828.5      4488.0     7090.5           239

[105 rows x 7 columns]

In [280]:
#already data loaded, dont run again
df_rr_nbh.to_sql(name='rental_rates', con=engine, if_exists='append', index=False)

In [281]:
#confirm data has been loaded to sql table
rr_nbh_sql = pd.read_sql_query('select * from rental_rates', con=engine)
rr_nbh_sql.head()

   nbh_id  studio  one_room  two_room  three_room  four_room  sample_count
0  273471  1195.0    1321.0    1527.0      2037.0     3505.0           229
1  271352  1164.5    1347.0    1635.5      2035.5     2804.0           225
2  275804  1309.0    1131.0    1383.0      1870.0     3576.0           210
3  271349   816.0    1518.5    1457.0      2018.5     2706.0           208
4  274033   939.0    1179.0    1549.5      2034.0     2440.5           199

In [308]:
rr_nbhs_info = []
for i in range(len(rates)):
    rates_info = rates[i]['detailed']
    for j in range(len(rates_info)):
        
        if (rates_info[j]['beds'] == "''"):
            beds = -1
        else:
            beds = rates_info[j]['beds']
        
        rr_nbh_info = {
            "nbh_id": rates_info[j]['neighborhood'],
            "bed_number": beds,
            "count": rates_info[j]['count'],
            "min": rates_info[j]['min'],
            "max": rates_info[j]['max'],
            "avg": rates_info[j]['avg'],
            "rental_income":rates_info[j]['adjusted_rental_income'],
            "median_value": rates_info[j]['median'],
            "median_night_rate":rates_info[j]['median_night_rate'],
            "median_occupancy":rates_info[j]['median_occupancy']
        }
        rr_nbhs_info.append(rr_nbh_info)
        
df_rr_nbh_info = pd.DataFrame(rr_nbhs_info)
df_rr_nbh_info['info_id'] = df_rr_nbh_info.index + 999
df_rr_nbh_info

,nbh_id,bed_number,count,min,max,avg,rental_income,median_value,median_night_rate,median_occupancy,info_id
0,273471,0,15,298,2556,1153.666667,1275.675000,1195.0,82.0,45.0,999
1,273471,1,77,129,2798,1408.142857,1798.030556,1321.0,88.0,59.0,1000
2,273471,2,57,0,4849,1662.736842,1879.851389,1527.0,99.0,56.0,1001
3,273471,3,61,275,9616,2359.098361,2080.500000,2037.0,145.0,45.0,1002
4,273471,4,13,1004,9592,4133.153846,3398.352778,3505.0,242.0,46.0,1003
...,...,...,...,...,...,...,...,...,...,...,...
725,403492,2,64,1330,5244,2972.671875,3126.579861,2828.5,147.0,65.5,1724
726,403492,3,38,2809,7491,4656.421053,4967.041667,4488.0,230.0,69.0,1725
727,403492,4,8,6200,8446,7323.500000,7784.334722,7090.5,328.5,77.0,1726
728,403492,5,1,6564,6564,6564.000000,6482.197222,6564.0,363.0,59.0,1727
729,403492,6,3,5781,9830,8323.333333,9351.097222,9359.0,367.0,83.0,1728

In [309]:
#already data loaded, dont run again
df_rr_nbh_info.to_sql(name='rental_rates_info', con=engine, if_exists='append', index=False)

In [311]:
#confirm data has been loaded to sql table
rr_nbh_info_sql = pd.read_sql_query('select * from rental_rates_info', con=engine)
rr_nbh_info_sql.head()

,info_id,nbh_id,bed_number,count,min,max,avg,rental_income,median_value,median_night_rate,median_occupancy
0,999,273471,0,15,298,2556,1153.666667,1275.675000,1195.0,82,45
1,1000,273471,1,77,129,2798,1408.142857,1798.030556,1321.0,88,59
2,1001,273471,2,57,0,4849,1662.736842,1879.851389,1527.0,99,56
3,1002,273471,3,61,275,9616,2359.098361,2080.500000,2037.0,145,45
4,1003,273471,4,13,1004,9592,4133.153846,3398.352778,3505.0,242,46

In [ ]:
# END DATABASE LOAD